### 판다스(Pandas)
- 데이터 처리 라이브러리 중 가장 인기있는 라이브러리이다.
- 2차원 데이터(테이블, 엑셀, CSV 등)를 효율적으로 가공 및 처리할 수 있다.
📌 대부분의 Dataset은 인간이 가장 이해하기 쉬운 구조인 2차원(행, 열)이다.

### 판다스 구성 요소
- DataFrame : 행과 열로 구성된 2차원 Dataset을 의미한다.
- Series : 1개의 열로만 구성된 1차원 Dataset을 의미한다.
- Index : DataFrame과 Series에서 중복없는 행 번호를 의미한다.

In [2]:
import pandas as pd
pd.__version__

'2.0.3'

### read_csv()
- .csv 파일을 DataFrame으로 읽어온다.
### display(_)
- 텍스트 데이터를 더 보기 좋게

In [6]:
happiness_df = pd.read_csv('./datasets/happiness_report_2022.csv')
happiness_df

         country  score               income
0        Finland  7.821          High income
1        Denmark  7.636          High income
2        Iceland  7.557          High income
3    Switzerland  7.512          High income
4    Netherlands  7.415          High income
..           ...    ...                  ...
141     Botswana  3.471  Upper middle income
142       Rwanda  3.268           Low income
143     Zimbabwe  2.995  Lower middle income
144      Lebanon  2.955  Lower middle income
145  Afghanistan  2.404           Low income

[146 rows x 3 columns]

### head()
- 전체 데이터 중 앞부분 일부를 가져온다.
### tail()
- 전체 데이터 중 뒷부분 일부를 가져온다.

In [8]:
display(happiness_df.head(10))
display(happiness_df.tail(10))

       country  score       income
0      Finland  7.821  High income
1      Denmark  7.636  High income
2      Iceland  7.557  High income
3  Switzerland  7.512  High income
4  Netherlands  7.415  High income
5   Luxembourg  7.404  High income
6       Sweden  7.384  High income
7       Norway  7.365  High income
8       Israel  7.364  High income
9  New Zealand  7.200  High income

          country  score               income
136        Zambia  3.760           Low income
137        Malawi  3.750           Low income
138      Tanzania  3.702  Lower middle income
139  Sierra Leone  3.574           Low income
140       Lesotho  3.512  Lower middle income
141      Botswana  3.471  Upper middle income
142        Rwanda  3.268           Low income
143      Zimbabwe  2.995  Lower middle income
144       Lebanon  2.955  Lower middle income
145   Afghanistan  2.404           Low income

In [15]:
# 원하는 컬럼만 가져오기

# 1차원으로 접근하면 Series 타입이다.
display(happiness_df["country"])

0          Finland
1          Denmark
2          Iceland
3      Switzerland
4      Netherlands
          ...
141       Botswana
142         Rwanda
143       Zimbabwe
144        Lebanon
145    Afghanistan
Name: country, Length: 146, dtype: object

### shape
- DataFrame의 행(Row)과 열(Column) 크기를 가지고 있는 속성이다.
- index는 열 개수에 포함하지 않는다.

In [18]:
print(happiness_df.shape)

(146, 3)

### DataFrame()
- dict를 DataFrame으로 변환할 때 사용한다.
- 컬럼명을 추가하거나 인덱스명을 변경하는